/* eslint-disable prettier/prettier */

export const doha = [
  'শ্রী গুরু চরণ সরোজ রজ নিজমন মুকুর সুধারি |',
  'বরণৌ রঘুবর বিমলযশ জো দাযক ফলচারি ||',
  'বুদ্ধিহীন তনুজানিকৈ সুমিরৌ পবন কুমার |',
  'বল বুদ্ধি বিদ্যা দেহু মোহি হরহু কলেশ বিকার্ ||',
];

export const dohaExplanation =
  'শ্রী গুরু চরণ রূপ কমলের পরাগের দ্বারা নিজের মন রূপ দর্পণ পরিষ্কার করে রঘুবর শ্রীরামচন্দ্রের বিমল বর্ণনা করতে প্রবৃত্তি হচ্ছে। শ্রী রামের এই কীর্তিগাথা ( ধর্ম, অর্থ, কাম এবং মোক্ষ ) চতুর্বিধ পুরুষার্থই প্রদান করে। কিন্তু আমি যে নিতান্ত নির্বোধ তা বুঝে পবন নন্দন হনুমান কে স্মরণ করছি। প্রভু আপনি কৃপা করে আমার সেই ক্ষমতা বুদ্ধি এবং বিদ্যা দান করুন, আমার সর্বপ্রকার ক্লেশ এবং তজ্জনিত বিকার সমূহ হরণ করুন।';

export const lastDoha = [
  'পবন তনয সংকট হরণ – মংগল মূরতি রূপ্ |',
  'রাম লখন সীতা সহিত – হৃদয বসহু সুরভূপ্ ||',
  'সিযাবর রামচংদ্রকী জয়| পবনসুত হনুমানকী জয়| ',
  'বোলো ভাযী সব সংতনকী জয |',
];

export const lsatDohaExplanation =
  'শ্রী রাম লক্ষণ এবং সীতাদেবী সহ সংকটমোচন, মঙ্গলময় বিগ্রহ সুরশ্রেষ্ঠ শ্রীপবননন্দন আমার হৃদয় বসতি করুন।';

export const chopai = [
  {
    text: ['জয় হনুমান জ্ঞান গুণ সাগর |', 'জয় কপীশ তিহু লোক উজাগর || এক ||'],
    onubad:
      'হে হনুমান, হে কবিশ্রেষ্ঠ, আপনার জয় হোক। জ্ঞান ও গুণের সাগর স্বরূপ আপনি।ত্রিভুবনে প্রসিদ্ধ আপনার নাম।',
  },
  {
    text: ['রামদূত অতুলিত বলধামা |', 'অংজনি পুত্র পবনসুত নামা || দুই ||'],
    onubad:
      'আপনি শ্রী রামের দূত। অতুলনীয় আপনার বল ও তেজ। অঞ্জনার পুত্র আপনি, পবন নন্দন নামেও আপনি পরিচিত।',
  },
  {
    text: ['মহাবীর বিক্রম বজরংগী |', 'কুমতি নিবার সুমতি কে সংগী || তিন ||'],
    onubad:
      'আপনি মহাবীর, মহাবিক্রমশালী, বজরংবলী। আপনি কুমতির নিবারণকর্তা এবং শুভ বুদ্ধির সঙ্গী।',
  },
  {
    text: ['কংচন বরণ বিরাজ সুবেশা |', 'কানন কুংডল কুংচিত কেশা || চার ||'],
    onubad:
      'স্বর্নবর্ণ দেহে শোভন বেশে কর্ণে কুন্ডল এবং কুঞ্ছিত কেশের দর্শনীয় আপনার রুপ।',
  },
  {
    text: ['হাথবজ্র ঔ ধ্বজা বিরাজৈ |', 'কাংথে মূংজ জনেবূ সাজৈ || পাঁচ ||'],
    onubad:
      'আপনার হাতে বজ্র এবং ধ্বজা বিরাজিত, স্কন্ধে মুঞ্জাতৃণ নির্মিত উপবীত শোভমান।',
  },
  {
    text: ['শংকর সুবন কেসরী নংদন |', 'তেজ প্রতাপ মহাজগ বংদন || ছয় ||'],
    onubad:
      'মহাদেবের অংশে জাত আপনি, বানর শ্রেষ্ঠ কেশরী আপনার পিতা। তেজস্ক্রিয়তা এবং প্রতাপে আপনি সর্ব জগতে পূজনীয়।',
  },
  {
    text: ['বিদ্যাবান গুণী অতি চাতুর |', 'রাম কাজ করিবে কো আতুর || সাত ||'],
    onubad:
      'বিদ্যা ও গুনে ভূষিত আপনি উদ্দেশ্য সাধনে অতিশয় দক্ষ ও চতুর শ্রী রামের কার্য সম্পাদনে আপনি সর্বদা তৎপর।',
  },
  {
    text: ['প্রভু চরিত্র সুনিবে কো রসিযা |', 'রামলখন সীতা মন বসিযা || আট ||'],
    onubad:
      'প্রভু শ্রী রামচন্দ্রের চরিত কথার রসগ্রাহী শ্রোতা আপনি আপনার হৃদয়ের শ্রী রাম,লক্ষণ ও সীতার বসতি।',
  },
  {
    text: ['সূক্ষ্ম রূপধরি সিযহি দিখাবা |', 'বিকট রূপধরি লংক জরাবা || নয় ||'],
    onubad:
      'সীতাদেবীর কাছে আপনি ক্ষুদ্র দেহ ধারণ করে দেখা দিয়েছিলেন। লঙ্কা দহন এর সময় বিকট আকার ধারণ করেছিলেন।',
  },
  {
    text: ['ভীম রূপধরি অসুর সংহারে |', 'রামচংদ্র কে কাজ সংবারে || দশ ||'],
    onubad:
      'রাক্ষস দের সংহারকালে আপনার রুপ অতি ভয়ংকর। এইভাবে শ্রীরামচন্দ্রের কাজের জন্য আপনি বিভিন্ন সময় বিভিন্ন রূপ ধারণ করেন।',
  },
  {
    text: ['লায সংজীবন লখন জিযাযে |', 'শ্রী রঘুবীর হরষি উরলাযে || এগারো ||'],
    onubad:
      'মৃতসঞ্জীবনী ঔষধি নিয়ে এসে আপনি শ্রী লক্ষণকে পুনর্জীবিত করেন। আনন্দচিত্তে শ্রীরাম আপনাকে বুকে জড়িয়ে ধরেন।',
  },
  {
    text: [
      'রঘুপতি কীন্হী বহুত বডাযী |',
      'তুম মম প্রিয ভরতহি সম ভাযী || বারো ||',
    ],
    onubad:
      'রঘুপতি আপনার অশেষ প্রশংসা করেন এবং আপনাকে তার ভরতের সমান ভাই বলেন।',
  },
  {
    text: ['সহস বদন তুম্হরো যশগাবৈ |', 'অস কহি শ্রীপতি কংঠ লগাবৈ || তেরো ||'],
    onubad:
      'আমি সহস্র বদনে তোমার যশ কীর্তন করি এই কথা বলে শ্রীরাম আপনাকে কণ্ঠলগ্ন করেন।',
  },
  {
    text: ['সনকাদিক ব্রহ্মাদি মুনীশা |', 'নারদ শারদ সহিত অহীশা || চোদ্দ ||'],
    onubad:
      'ব্রম্ভাদি দেবশ্রেষ্টগণ স্বয়ং দেবী সরস্বতী সনকাদীক মুনি চতুষ্টয় অনন্তনাগ নারদ সহ অন্যান্য ঋষি বৃন্দ আপনার যশ কৃত্তন করেন।',
  },
  {
    text: ['যম কুবের দিগপাল জহাং তে |', 'কবি কোবিদ কহি সকে কহাং তে | পনেরো ||'],
    onubad:
      'যমরাজ কুবের আদি দিশার রক্ষক, বিদ্যমান পন্ডিত আপনার যশ এর বর্ণনা করতে পারেনা।',
  },
  {
    text: ['তুম উপকার সুগ্রীবহি কীন্হা |', 'রাম মিলায রাজপদ দীন্হা || ষোল  ||'],
    onubad:
      'আপনি সুগ্রীবের সঙ্গে  রামের মিলন ঘটিয়ে তাকে রাজপদে পুনঃপ্রতিষ্ঠা করে তার পরম উপকার সাধন করেছিলেন।',
  },
  {
    text: ['তুম উপকার সুগ্রীবহি কীন্হা |', 'রাম মিলায রাজপদ দীন্হা || ষোল  ||'],
    onubad:
      'আপনি সুগ্রীবের সঙ্গে  রামের মিলন ঘটিয়ে তাকে রাজপদে পুনঃপ্রতিষ্ঠা করে তার পরম উপকার সাধন করেছিলেন।',
  },
  {
    text: ['তুম্হরো মংত্র বিভীষণ মানা |', 'লংকেশ্বর ভযে সব জগ জানা || সতের ||'],
    onubad:
      'বিভীষন আপনার পরামর্শ মেনে ছিলেন এবং তার পরিনামে তিনি লাঙ্কার অধীশ্বর হয়েছিলেন একথা জগতের সকলেই জানে।',
  },
  {
    text: ['যুগ সহস্র যোজন পর ভানূ |', 'লীল্যো তাহি মধুর ফল জানূ || আঠারো  ||'],
    onubad:
      'এক যুগ সহস্র যোজন দূরে অবস্থিত যে সুর্যদেব তাকে আপনি মিষ্ট ফল জ্ঞানে গ্রহণ করতে উদ্যত হয়েছিলেন।',
  },
  {
    text: [
      'প্রভু মুদ্রিকা মেলি মুখ মাহী |',
      'জলধি লাংঘি গযে অচরজ নাহী || উনিশ ||',
    ],
    onubad:
      'আপনি শ্রীরামচন্দ্রের  আংটি মুখে নিয়ে সাগর লঙঘন করে পরাপারে গেছিলেন – এতে আশ্চর্যের কিছু নেই।',
  },
  {
    text: ['দুর্গম কাজ জগত কে জেতে |', 'সুগম অনুগ্রহ তুম্হরে তেতে || কুড়ি  ||'],
    onubad: 'জগতে যত দুষ্কর কাজ রয়েছে সবই আপনার কৃপায় সহজসাধ্য হয়ে ওঠে।',
  },
  {
    text: ['রাম দুআরে তুম রখবারে |', 'হোত ন আজ্ঞা বিনু পৈসারে || একুশ  ||'],
    onubad:
      'শ্রী রামের দ্বারে আপনি রক্ষক। আপনার অনুমতি ব্যতীত কেউ এখানে প্রবেশ করতে পারে না। অর্থাৎ আপনার কৃপা ব্যতিত ভগবান রামের প্রতি ভক্তি লাভ হয় না।',
  },
  {
    text: ['সব সুখ লহৈ তুম্হারী শরণা |', 'তুম রক্ষক কাহূ কো ডর না || বাইশ ||'],
    onubad:
      'যে আপনার শরণ নেয় সে স্বর্গ সুখ লাভ করে। আপনি যাকে রক্ষা করেন কারো কাছ থেকে তার আর ভয় থাকে না।',
  },
  {
    text: ['আপন তেজ তুম্হারো আপৈ |', 'তীনোং লোক হাংক তে কাংপৈ || তেইশ ||'],
    onubad:
      'আপনার তেজ একমাত্র আপনি সম্বরন করতে পারেন। আপনার হুংকারে ত্রিভুবন কম্পিত হয়।',
  },
  {
    text: ['ভূত পিশাচ নিকট নহি আবৈ |', 'মহবীর জব নাম সুনাবৈ || চব্বিশ ||'],
    onubad:
      'মহাবীর হনুমান এর নাম যেখানে উচ্চারিত হয় ভূত পিশাচ  সে স্থানের নিকট আসতে পারে না।',
  },
  {
    text: ['নাসৈ রোগ হরৈ সব পীরা |', 'জপত নিরংতর হনুমত বীরা || পঁচিশ ||'],
    onubad: 'নিরন্তর হনুমানের নাম জপ করলে সর্বপ্রকার রোগ পীড়া বিনষ্ট হয়।',
  },
  {
    text: [
      'সংকট সেং হনুমান ছুডাবৈ |',
      'মন ক্রম বচন ধ্যান জো লাবৈ || ছাব্বিশ  ||',
    ],
    onubad:
      'সংকটে পতিত হলে শ্রী হনুমান এর নাম কীর্তন,মনে তাকে স্মরণ এবং ক্রমশ তাকে ধ্যান করলে সেই সংকট থেকে তাকে তিনি মুক্ত করেন।',
  },
  {
    text: ['সব পর রাম তপস্বী রাজা |', 'তিনকে কাজ সকল তুম সাজা || সাতাশ ||'],
    onubad:
      'তাপস্বী শ্রীরাম জগতের সকলের প্রভু। সেই মহামহীমাশালীর সকল গুরুতর কর্মসমূহের দায়িত্ব পালন আপনার পক্ষে সম্ভব হয়েছিল।',
  },
  {
    text: ['ঔর মনোরধ জো কোযি লাবৈ |', 'তাসু অমিত জীবন ফল পাবৈ || আঠাশ ||'],
    onubad:
      'অন্য যে কোন মনোবাসনা নিয়ে যে আপনার দারস্ত হয়। সেই অনন্ত জীবনের জন্য সেই সব ফললাভ করে।',
  },
  {
    text: [
      'চারো যুগ পরিতাপ তুম্হারা |',
      'হৈ পরসিদ্ধ জগত উজিযারা || উনত্রিশ ||',
    ],
    onubad:
      'সর্বজগতেই একথা প্রসিদ্ধ আছে যে চার যুগেই আপনার প্রতাপ  সমুজ্জল ভাবে বর্তমান।',
  },
  {
    text: ['সাধু সংত কে তুম রখবারে |', 'অসুর নিকংদন রাম দুলারে || ত্রিশ ||'],
    onubad:
      'অসাধু সজ্জনগনের আপনি রক্ষাকর্তা, অসুরদের বিনাশকারী এবং শ্রীরামচন্দ্রের একান্ত প্রিয়পাত্র।',
  },
  {
    text: [
      'অষ্ঠসিদ্ধি নব নিধি কে দাতা |',
      'অস বর দীন্হ জানকী মাতা || একত্রিশ ||',
    ],
    onubad:
      'মাতা জনকীদেবী আপনাকে এরুপ বর দিয়েছিলেন যে, আপনি ইচ্ছা করলেই অষ্ট সিদ্ধি এবং  নয় প্রকারম সম্পদ দান করতে পারেন।',
  },
  {
    text: [
      'রাম রসাযন তুম্হারে পাসা |',
      'সাদ রহো রঘুপতি কে দাসা || বঁত্রিশ  ||',
    ],
    onubad:
      'শ্রী রামের প্রতি প্রেমভক্তি আপনার ভান্ডারে বিদ্যমান। হে রঘুপতি দাস মহাবীর হনুমান আপনি সর্বদা আমার নিকট থাকুন।',
  },
  {
    text: [
      'তুম্হরে ভজন রামকো পাবৈ |',
      'জন্ম জন্ম কে দুখ বিসরাবৈ || তেঁত্রিশ  ||',
    ],
    onubad:
      'আপনার ভজনা করলে তা প্রকৃতপক্ষে শ্রী রামের উদ্দেশ্যে নিবেদিত হয় এবং শ্রী রামের প্রতি সম্পাদন করে। জন্ম-জন্মান্তরের সঞ্চিত দুঃখ ভুলিয়ে দেয়।',
  },
  {
    text: ['অংত কাল রঘুবর পুরজাযী |', 'জহাং জন্ম হরিভক্ত কহাযী || চৌত্রিশ ||'],
    onubad:
      'যেখানেই সেই ভোজনকারী জন্ম হোক না কেন তা ভগবদ্ভক্ত রূপেই তার পরিচিত হয় এবং এতে তিনি শ্রী রামের নিত্য ধামে গমন করেন।',
  },
  {
    text: ['ঔর দেবতা চিত্ত ন ধরযী |', 'হনুমত সেযি সর্ব সুখ করযী || পঁত্রিশ ||'],
    onubad:
      'অপর কোন দেবতার প্রতি চিত্ত নিবিষ্ট না করেও কেবল হনুমানের সেবা করলে সর্ব ফললাভ হতে পারে।',
  },
  {
    text: ['সংকট কটৈ মিটৈ সব পীরা |', 'জো সুমিরৈ হনুমত বল বীরা || ছঁত্রিশ ||'],
    onubad:
      'যিনি মহাবলীবীর্যসমন্বিত শ্রী হনুমান কে স্মরণ করেন তার সকল সংক্রমিত হয় সর্ব রোগ নিরাময় হয়।',
  },
  {
    text: [
      'জৈ জৈ জৈ হনুমান গোসাযী |',
      'কৃপা করো গুরুদেব কী নাযী || সাঁইত্রিশ ||',
    ],
    onubad:
      'হে প্রভু হনুমানজি, আপনার জয় হোক, জয় হোক, জয় হোক। গুরুদেব যেমন তার শীষ্যের প্রতি অনুগ্রহ প্রকাশ করে থাকেন সেই রকম আপনিও আমাকে কৃপা করুন।',
  },
  {
    text: ['জো শত বার পাঠ কর কোযী |', 'ছূটহি বংদি মহা সুখ হোযী || আঁটত্রিশ ||'],
    onubad:
      'এই হনুমান চালিশা যে শত বার পাঠ করবে তার বন্ধনমুক্তি ঘটবে এবং সে প্রভূত সুখ সৌভাগ্য লাভ করবে।',
  },
  {
    text: [
      'জো যহ পডৈ হনুমান চালীসা |',
      'হোয সিদ্ধি সাখী গৌরীশা || উনচল্লিশ ||',
    ],
    onubad:
      'যে কেউ এই হনুমান চালিশা পাঠ করবে তার সিদ্ধিলাভ হবে। এ বিষয়ে স্বয়ং মহাদেব প্রমাণ।',
  },
  {
    text: ['তুলসীদাস সদা হরি চেরা |', 'কীজৈ নাথ হৃদয মহ ডেরা || চল্লিশ  ||'],
    onubad:
      'তুলসীদাস সদাসর্বদাই শ্রী হরির সেবক,দাসানুদাস।হে প্রভু আপনি তার হৃদয়টিকে আপনার বাসস্থানে পরিণত করুন অর্থাৎ তার হৃদয়ে নিত্য বাস করুন।',
  },
];
